app/views/this_is_for_beginner/home.html.erb

      <div>
        <%= select_tag :detail_maker, options_for_select(@maker.map{|m|[m.maker_name, m.id]}),:include_blank => true%>
---
SELECT "makers".* FROM "makers"