app/views/sizes/index.html.erb

SELECT "sizes".* FROM "sizes"
---
      <tr>
        <td><%= size.size %></td>