app/views/this_is_for_intermediate_or_advanced/home.html.erb

<div>
<%= select_tag :maker_id, options_from_collection_for_select(Maker.all, :id, :maker_name)%>
<%= select_tag :bike_id, options_from_collection_for_select(Bike.all, :id, :bike_name)%>
---
SELECT "makers".* FROM "makers"
SELECT "bikes".* FROM "bikes"