app/controllers/admins_controller.rb

  def index
    @user = Mangement.find_by(id: session[:id])
---
SELECT  "mangements".* FROM "mangements" WHERE "mangements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def import_csv
    result = Roadbike.create_bike_from_csv(params[:csv_file])
---
INSERT INTO "roadbikes" ("maker_id", "bike_series", "bike_name", "frame_type", "rear_derailleur", "front_derailleur", "crank", "brake", "chain", "sprocket", "sti_lever", "bb", "wheel", "saddle", "seat_pillar", "handle", "stem", "tire", "pedal", "valve", "accessory", "maker_url", "shop_url", "created_at", "updated_at", "price", "gear", "fork", "frame_name", "fork_type", "tire_type", "component", "road_bike_type", "brake_type", "bike_comment") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)