app/controllers/bikes_controller.rb

  def index
    @bikes = Bike.all
---
SELECT "bikes".* FROM "bikes"

    def set_bike
      @bike = Bike.find(params[:id])
---
SELECT  "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]