app/controllers/sizes_controller.rb

  def index
    @sizes = Size.all
---
SELECT "sizes".* FROM "sizes"