app/controllers/this_is_for_beginner_controller.rb

  def home
    @bike_info = Roadbike.new
    @maker = Maker.all
---
SELECT "makers".* FROM "makers"

  def result
    result = Roadbike.serch_mach_bike(check_params_from_home[:price_up],
                                      check_params_from_home[:price_down],
                                      check_params_from_home[:sex],
                                      check_params_from_home[:detail_bike_type],
                                      check_params_from_home[:detail_maker],
                                      check_params_from_home[:detail_frame],
                                      check_params_from_home[:detail_component],
                                      check_params_from_home[:brake_type],
                                      check_params_from_home[:color],
                                      "all"
                                     )
    @bike = Roadbike.serch_bike_result_and_size(result, check_params_from_home[:user_size].to_i)
    @color = check_params_from_home[:color]
    @length = @bike.length if @bike != nil
---
SELECT "bikes".* FROM "bikes" WHERE (frame_type "#{params[:detail_frame]}")