app/controllers/this_is_for_beginner_controller.rb

  def result
 serch_params = check_params_from_home
  p params[:detail_bike_type].to_i
  p Bike.where(road_bike_type: params[:detail_bike_type].to_i)
---
SELECT "bikes".* FROM "bikes" WHERE "bikes"."road_bike_type" = ?  [["road_bike_type", 1]]