app/controllers/this_is_for_intermediate_or_advanced_controller.rb

SELECT "bikes".* FROM "bikes" WHERE "bikes"."maker_id" = ?  [["maker_id", 2]]
---
  def get_bike_name
    @bikes = Roadbike.where(maker_id: params[:maker_id])

SELECT "bikes".* FROM "bikes" WHERE "bikes"."maker_id" = ?  [["maker_id", 1]]
---
  def get_bike_name_1
    @bikes_1 = Roadbike.where(maker_id: params[:maker_id])